ИС_СПОРТ_2022/src/Documents/УстановкаМеждународнойВозрастнойГруппы/УстановкаМеждународнойВозрастнойГруппы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаМеждународнойВозрастнойГруппы</name>
  <registerRecords>InformationRegister.МеждународныеВозрастныеГруппы</registerRecords>
  <attributes>
    <name>УчебныйГод</name>
    <type>
      <types>CatalogRef.УчебныйГод</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСпорта</name>
    <type>
      <types>CatalogRef.ВидыСпорта</types>
    </type>
  </attributes>
  <attributes>
    <name>МеждународнаяВозрастнаяГруппа</name>
    <type>
      <types>CatalogRef.МеждународныеВозрастныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Спортсмены</name>
    <attributes>
      <name>Спортсмен</name>
      <type>
        <types>CatalogRef.Спортсмены</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ИС_СПОРТ_2022/src/Documents/УстановкаМеждународнойВозрастнойГруппы/ManagerModule.bsl
#Область Проведение

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	Отказ = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка"                       , ДокументСсылка);
	Запрос.УстановитьПараметр("Период"                       , ДокументСсылка.Дата);
	Запрос.УстановитьПараметр("УчебныйГод"		             , ДокументСсылка.УчебныйГод);
	Запрос.УстановитьПараметр("Организация"                  , ДокументСсылка.Организация);
	Запрос.УстановитьПараметр("ВидСпорта"                    , ДокументСсылка.ВидСпорта);
	Запрос.УстановитьПараметр("МеждународнаяВозрастнаяГруппа", ДокументСсылка.МеждународнаяВозрастнаяГруппа);
	Запрос.Текст =  "ВЫБРАТЬ
	                |	""МеждународныеВозрастныеГруппыПоУчебнымГодам"" КАК ИмяРегистра_,
	                |	&Период КАК Период,
					|	&УчебныйГод КАК УчебныйГод,
					|	&Организация КАК Организация,
					|	&ВидСпорта КАК ВидСпорта,
	                |	&МеждународнаяВозрастнаяГруппа КАК МеждународнаяВозрастнаяГруппа,
	                |	УстановкаВозрастнойГруппыСпортсмены.Спортсмен КАК Спортсмен
	                |ИЗ
	                |	Документ.УстановкаМеждународнойВозрастнойГруппы.Спортсмены КАК УстановкаВозрастнойГруппыСпортсмены
	                |ГДЕ
	                |	УстановкаВозрастнойГруппыСпортсмены.Ссылка = &Ссылка";
	
	ТаблицаВозрастныеГруппыПоУчебнымГодам = Запрос.Выполнить().Выгрузить();
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	ТаблицыДляДвижений.Вставить("ТаблицаМеждународныеВозрастныеГруппы" , ТаблицаВозрастныеГруппыПоУчебнымГодам);
	
    ДополнительныеСвойства.Вставить("Отказ", Отказ);
	
КонецПроцедуры	

Процедура ВыполнитьКонтрольРезультатовПроведения(Объект, Отказ) Экспорт
	
	Если Ложь Тогда
		Объект = Документы.УстановкаМеждународнойВозрастнойГруппы.СоздатьДокумент();
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьКонтрольПередПроведением(Объект, Отказ) Экспорт
	
	Если Ложь Тогда
		Объект = Документы.УстановкаМеждународнойВозрастнойГруппы.СоздатьДокумент();
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьКонтрольРезультатовОтменыПроведения(Объект, Отказ) Экспорт
	
	Если Ложь Тогда
		Объект = Документы.УстановкаМеждународнойВозрастнойГруппы.СоздатьДокумент();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
